SOURCE/EXAMPLES/BFS/0/umag
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      umag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
0.10379
0.000347646
0.254733
0.00141688
0.40005
0.00207295
0.588181
0.0030325
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 44.2;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
113
(
0.00423498
0.0107102
0.0126678
0.0149839
0.0177243
0.0209671
0.0248046
0.0293461
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
