SOURCE/EXAMPLES/BFS/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
218
(
(-53.6479 2.60337e-07 0)
(-53.6471 2.25115e-07 0)
(-53.6465 1.97609e-07 0)
(-53.6462 1.13714e-07 0)
(-53.6458 1.38635e-07 0)
(-53.6456 1.79901e-08 0)
(-53.6454 1.14498e-07 0)
(-53.6452 -7.52421e-10 0)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
266
(
(-52.0205 -2.46121e-07 0)
(-52.0197 -1.57788e-07 0)
(-52.0191 -1.70612e-07 0)
(-52.0186 -5.60123e-08 0)
(-52.0184 -1.11647e-07 0)
(-52.0182 -2.16499e-08 0)
(-52.018 -1.04696e-07 0)
(-52.0178 -2.66213e-08 0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
