SOURCE/EXAMPLES/BFS/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);

